import mongoose from "mongoose";

const typeMarche = {
  type: Array,
  default: ["إنتاج", "الجملة", "ذات مصلحة وطنية"]
};

const categorieProduitMarche = {
  type: Array,
  default: [
    "باكورات",
    "قوارص",
    "التمور",
    "الزيتون",
    "بقول الجافة",
    "خضر و غلال",
    "صيد البحري",
    "أسمدة فلاحية",
    "لحوم حمراء و منتوجات حيوانية",
    "دواجن و منتوجاتها"
  ]
};

const produits = {
  type: Array,
  default: [
    ["باكورات", ["فراولة", "فول أخضر", "بصل أخضر", "بطاطا جديدة"]],
    ["قوارص", ["برتقال مالتا", "كليمونتين", "لّيم", "بُرْتُقال أبوصرة"]],
    ["التمور", ["دقلة النور", "العليق", "الكنتي", "المجدول"]],
    ["الزيتون", ["زيتون الشملالي", "زيتون السوسي", "زيت زيتونة شملالي", "زيت زيتون عضوي"]],
    ["بقول الجافة", ["عدس", "حمص", "فول يابس", "لوبيا"]],
    ["خضر و الغلال", [
      "طماطم", "فلفل", "بصل", "بطيخ", "مشمش", "خوخ", "رمان",
      "فلفل حلو", "فلفل حار", "بصل يابس", "ثوم", "بطاطا", "جزر", 
      "قرع أحمر", "قرع أخضر", "خس", "سبناخ", "ملوخية", "باذنجان", 
      "قنارية (خرشوف)", "كرنب (كرمب)", "كرافس", "نعناع", "معدنوس", 
      "سلق", "لفت", "الشمندر الأحمر", "الكراث (البورو)", 
      "الجرجير (روكا)", "الفصة الخضراء", "تفاح القصرين", 
      "إجاص ساقية سيدي يوسف", "مشمش الكاف", "خوخ بوحجلة", 
      "رمان قابس", "عنب قفصة", "بطيخ أحمر", "دلاع", "تين الشواشي", 
      "فراولة نفزاوة", "موز مستورد (متداول في الأسواق)", "زعرور", 
      "كيوي", "مانجو", "تمر هندي )", 
      "ليمون بني خلاد", "جوافة", "تين شوكي (هندي)"
    ]],
    ["صيد البحري", ["سردينة", "ورقة", "قرنيط", "تنّ", "جمبري"]],
    ["لحوم حمراء و منتوجات حيوانية", ["لحم غنم", "لحم بقري", "حليب طازج", "جبن عربي", "لبن"]],
    ["أسمدة فلاحية", ["الأمونيترات", "ثلاثي الفسفاط الرفيع", "ثاني أمونيا الفسفاط", "الأسمدة المركبة"]],
    ["دواجن و منتوجاتها", ["بيض", "لحوم بيضاء"]]
  ]
};

const produitTarifsParkillo = {
  type: Array,
  default: [["كيوي", 10], ["تمر", 20]]
};

const newDate = {
  type: Date,
  default: Date.now
};

const typeDesProducteurs = {
  type: Array,
  default: ["منتج", "شركة إنتاج", "تجمع إنتاجي"]
};

const typeDesVendeurs = {
  type: Array,
  default: ["وكيل بيع بالجملة", "مورد", "بائع بالتفصيل", "مجمع إنتاج"]
};




const administrationSchema = new mongoose.Schema({
  typeMarche,
  categorieProduitMarche,
  produits,
  produitTarifsParkillo,
  newDate,
  oldDate: Date,
  typeDesProducteurs,
  typeDesVendeurs
  // Add other fields as needed
});

 

const AdministrationModel = mongoose.models.Administration || mongoose.model("Administration", administrationSchema);

export default AdministrationModel;